In [1]:
#concate 
# It is used to combine more than one data frame or series

In [2]:
import pandas as pd

In [3]:
ser1=pd.Series([1,2,3,4])
ser2=pd.Series([4,5,6,7])

In [5]:
con_ser=pd.concat([ser1,ser2])

In [6]:
con_ser

0    1
1    2
2    3
3    4
0    4
1    5
2    6
3    7
dtype: int64

In [7]:
con_ser=pd.concat([ser1,ser2],ignore_index=True)

In [8]:
con_ser

0    1
1    2
2    3
3    4
4    4
5    5
6    6
7    7
dtype: int64

In [10]:
df1=pd.DataFrame({'A':['A0','A1','A2','A3'],
                 'B':['B0','B1','B2','B3'],
                  'C':['C0','C1','C2','C3']
                 })
df2=pd.DataFrame({'A':['A4','A5','A6','A7'],
                 'B':['B4','B5','B6','B7'],
                  'C':['C4','C5','C6','C7']
                 })

In [11]:
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3

In [12]:
df2

    A   B   C
0  A4  B4  C4
1  A5  B5  C5
2  A6  B6  C6
3  A7  B7  C7

In [16]:
df_res=pd.concat([df1,df2]) # here it is combined by index or axis=0

In [14]:
df_res

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
0  A4  B4  C4
1  A5  B5  C5
2  A6  B6  C6
3  A7  B7  C7

In [17]:
df_res1=pd.concat([df1,df2],axis=1)

In [18]:
df_res1

    A   B   C   A   B   C
0  A0  B0  C0  A4  B4  C4
1  A1  B1  C1  A5  B5  C5
2  A2  B2  C2  A6  B6  C6
3  A3  B3  C3  A7  B7  C7

In [26]:
df3=pd.DataFrame({'A':['A0','A1','A2','A3'],
                 'B':['B0','B1','B2','B3'],
                  'C':['C0','C1','C2','C3']
                 },index=[1,2,3,4])
df4=pd.DataFrame({'A':['A4','A5','A6','A7'],
                 'B':['B4','B5','B6','B7'],
                  'C':['C4','C5','C6','C7']
                 },index=[1,2,5,6])

In [27]:
df3

    A   B   C
1  A0  B0  C0
2  A1  B1  C1
3  A2  B2  C2
4  A3  B3  C3

In [28]:
df4

    A   B   C
1  A4  B4  C4
2  A5  B5  C5
5  A6  B6  C6
6  A7  B7  C7

In [22]:
df_res2=pd.concat([df3,df4])

In [23]:
df_res2

    A   B   C
1  A0  B0  C0
2  A1  B1  C1
3  A2  B2  C2
4  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5
5  A6  B6  C6
6  A7  B7  C7

In [30]:
df_res3=pd.concat([df3,df4],axis=1)

In [32]:
df_res3

     A    B    C    A    B    C
1   A0   B0   C0   A4   B4   C4
2   A1   B1   C1   A5   B5   C5
3   A2   B2   C2  NaN  NaN  NaN
4   A3   B3   C3  NaN  NaN  NaN
5  NaN  NaN  NaN   A6   B6   C6
6  NaN  NaN  NaN   A7   B7   C7

In [33]:
df_res3=pd.concat([df3,df4],axis=1,join='inner')

In [35]:
df_res3

    A   B   C   A   B   C
1  A0  B0  C0  A4  B4  C4
2  A1  B1  C1  A5  B5  C5